// ------------------------------ 1️⃣ السؤال الأول ------------------------------
//     - driving اسمها function عرف دالة او
//     - تأخذ عمر شخص (رقم) واذا كان اكبر من 18 تطبع
//          🚘😍 مبروك سوف تحصل على الليسن
//     - واذا كان اقل من 18 يطبع
//          😢 للاسف عمرك لا يسمح
//     console.log ، if ملاحظة: سوف تستخدم

// 👇 هنا function عرف الدالة او



// لا تنسى أن تنادي الدالة



// ------------------------------ 2️⃣ السؤال الثاني ------------------------------
// 2️⃣ السؤال الثاني
//     - iceCream واجعل اسمها array عرف مصفوفة او
//     - 🍦 احفظ فيها مجموعة من نكهات الآيس كريم
//     - console.log لطباعة قائمة نكهات الآيس كريم بإستخدام for loop استخدم

// 👇 هنا array عرف المصفوفة او





// --------------------------------- ✨ بونص ------------------------------------
// بحيث عند مناداة الدالة تطبع القائمة myIceCream بإسم function عرف دالة او
// for loop عرف مصفوفة أخرى تحتوي على أفلامك الكرتون المفضلة بالنسبة لك وقم بطباعة الأفلام بإستخدام

// --------------------------------- 🔥 بونص ------------------------------------
// while loop اطبع احد المصفوفات بإستخدام

function driving (x){
     x = 18;
    if(x>=18){
        console.log(`🚘😍 مبروك سوف تحصل على الليسن`)
    }else{
        console.log(` 😢 للاسف عمرك لا يسمح`)
    }
}

driving();



 let iceCream = [ 'بو ذهب' , 'برد توت' , `برد موز`]
for (let type = 0; type < iceCream.length; type++) {
   console.log(iceCream[type]);
}


let  iceCream2 = [ 'لولو' , 'باسكن روبنز ' , `برد موز`]
function myIceCream (x){

 for (let x = 0; x < iceCream2.length; x++) {

     console.log(iceCream2[x])
 }
}
myIceCream()

let number = 0
while (number<iceCream.length) {
    console.log(iceCream[number])
    number++
}